In [8]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [18]:
%sql postgresql://student:student@127.0.0.1/sparkifydb

In [19]:
%sql SELECT * FROM songplays LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(0, datetime.datetime(2018, 11, 23, 0, 7, 25, 796000), 66, 'free', None, None, 815, 'Harrisburg-Carlisle, PA', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.125 Safari/537.36"'),
 (1, datetime.datetime(2018, 11, 23, 0, 11, 0, 796000), 66, 'free', None, None, 815, 'Harrisburg-Carlisle, PA', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.125 Safari/537.36"'),
 (2, datetime.datetime(2018, 11, 23, 0, 14, 24, 796000), 66, 'free', None, None, 815, 'Harrisburg-Carlisle, PA', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.125 Safari/537.36"'),
 (3, datetime.datetime(2018, 11, 23, 0, 17, 16, 796000), 66, 'free', None, None, 815, 'Harrisburg-Carlisle, PA', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.125 Safari/537.36"'),
 (4, datetime.datetime(2018, 11, 23, 0, 20, 45, 796000), 66, 'free', None, None, 815, 'Harrisburg-Carlisle, PA', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.125 Safari/537.36"')]

In [20]:
%sql SELECT * FROM users LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(66, 'Kevin', 'Arellano', 'M', 'free'),
 (63, 'Ayla', 'Johnson', 'F', 'free'),
 (58, 'Emily', 'Benson', 'F', 'paid'),
 (26, 'Ryan', 'Smith', 'M', 'free'),
 (16, 'Rylan', 'George', 'M', 'paid')]

In [21]:
%sql SELECT * FROM songs LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
1 rows affected.

[('SONHOTT12A8C13493C', 'Something Girls', 'AR7G5I41187FB4CE6C', 1982, 233)]

In [22]:
%sql SELECT * FROM artists LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
1 rows affected.

[('AR7G5I41187FB4CE6C', 'Adam Ant', 'London, England', nan, nan)]

In [23]:
%sql SELECT * FROM time LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(datetime.datetime(2018, 11, 23, 0, 7, 25, 796000), 0, 23, 47, 11, 2018, 4),
 (datetime.datetime(2018, 11, 23, 0, 11, 0, 796000), 0, 23, 47, 11, 2018, 4),
 (datetime.datetime(2018, 11, 23, 0, 14, 24, 796000), 0, 23, 47, 11, 2018, 4),
 (datetime.datetime(2018, 11, 23, 0, 17, 16, 796000), 0, 23, 47, 11, 2018, 4),
 (datetime.datetime(2018, 11, 23, 0, 20, 45, 796000), 0, 23, 47, 11, 2018, 4)]

## REMEMBER: Restart this notebook to close connection to `sparkifydb`
Each time you run the cells above, remember to restart this notebook to close the connection to your database. Otherwise, you won't be able to run your code in `create_tables.py`, `etl.py`, or `etl.ipynb` files since you can't make multiple connections to the same database (in this case, sparkifydb).